app/views/home/patient_detail.html.erb

  <button type="submit" class="btn btn-default">Submit</button>
  <% @patient.detailcoms.each do |pc| %>
---
SELECT "detailcoms".* FROM "detailcoms" WHERE "detailcoms"."patient_id" = ?  [["patient_id", 1]]