app/views/home/patientlist.html.erb

          <td><%= patient.id %></td>
          <td><%= patient.detailcoms.length %></td>
---
SELECT "detailcoms".* FROM "detailcoms" WHERE "detailcoms"."patient_id" = ?  [["patient_id", 1]]