app/controllers/home_controller.rb

SELECT "posts".* FROM "posts"
---
  def index
    @post = Post.all

SELECT "posttests".* FROM "posttests"
---
  def index2
    @post123 = Posttest.all

INSERT INTO "posttests" ("title2", "content2", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title2", "asef"], ["content2", "adsf"], ["created_at", "2017-08-25 02:32:16.362966"], ["updated_at", "2017-08-25 02:32:16.362966"]]
---
  def write2
    post = Posttest.new
    post.title2 = params[:title2]
    post.content2 = params[:content2]
    post.save

INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "aesf"], ["content", "aefs"], ["created_at", "2017-08-25 00:58:50.170079"], ["updated_at", "2017-08-25 00:58:50.170079"]]
---
  def write
    post = Post.new
    post.title = params[:title]
    post.content = params[:content]
    post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @edit = Post.find(params[:id])

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
---
  def update
    update = Post.find(params[:id])

INSERT INTO "dcomments" ("content", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "d"], ["post_id", 1], ["created_at", "2017-08-25 05:16:39.365440"], ["updated_at", "2017-08-25 05:16:39.365440"]]
---
  def dcomment
    dcomment = Dcomment.new
    dcomment.content = params[:content]
    dcomment.post_id = params[:id]
    dcomment.save

SELECT "patients".* FROM "patients"
---
  def patientlist
    @patients = Patient.all

SELECT  "patients".* FROM "patients" WHERE "patients"."id" = ? LIMIT 1  [["id", 1]]
---
  def patient_detail
    @patient = Patient.find_by_id(params[:id])

INSERT INTO "detailcoms" ("content", "patient_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "d"], ["patient_id", 2], ["created_at", "2017-08-25 17:05:53.292494"], ["updated_at", "2017-08-25 17:05:53.292494"]]
---
  def patient_comment
    comment = Detailcom.new
    comment.content = params[:putcomment]
    comment.patient_id = params[:patient_id]
    comment.save